import React from 'react'

const UserSuccess: React.FC = () => {
	return (
		<>
			{/* <p className="text-[#f2f2f2]">
				Пользовательское Соглашение Настоящее Пользовательское Соглашение (Далее
				Соглашение) регулирует отношения между ООО "ИТКАБА" (далее Каба или
				Администрация) с одной стороны и пользователем сайта с другой. Сайт Каба
				не является средством массовой информации. Используя сайт, Вы
				соглашаетесь с условиями данного соглашения. Если Вы не согласны с
				условиями данного соглашения, не используйте сайт Каба! Права и
				обязанности сторон Пользователь имеет право: - осуществлять поиск
				информации на сайте - получать информацию на сайте - распространять
				информацию на сайте - комментировать контент, выложенный на сайте -
				изменять рейтинг пользователей - копировать информацию на другие сайты с
				указанием источника - использовать информацию сайта в личных
				некоммерческих целях - использовать информацию сайта в коммерческих
				целях без специального разрешения Администрация имеет право: - по своему
				усмотрению и необходимости создавать, изменять, отменять правила -
				ограничивать доступ к любой информации на сайте - создавать, изменять,
				удалять информацию - удалять учетные записи Пользователь обязуется: - не
				распространять информацию, которая направлена на пропаганду войны,
				разжигание национальной, расовой или религиозной ненависти и вражды, а
				также иной информации, за распространение которой предусмотрена
				уголовная или административная ответственность - не нарушать
				работоспособность сайта - не совершать действия, направленные на
				введение других Пользователей в заблуждение - не размещать материалы
				рекламного, эротического, порнографического или оскорбительного
				характера, а также иную информацию, размещение которой запрещено или
				противоречит нормам действующего законодательства РФ Администрация
				обязуется: - поддерживать работоспособность сайта за исключением
				случаев, когда это невозможно по независящим от Администрации причинам.
				- защищать информацию, распространение которой ограничено или запрещено
				законами путем вынесения предупреждения либо удалением учетной записи
				пользователя, нарушившего правила - предоставить всю доступную
				информацию о Пользователе уполномоченным на то органам государственной
				власти в случаях, установленных законом Условия выплат: - Администрация
				и Пользователь обязуются выполнять требования и условия партнерского
				платежного сервиса. - Администрация не ограничивает размер выплат и
				частоту выплат, но партнерский платежный сервис может применять свои
				ограничения. Обязанности сторон в отношении выплат: - Администрация
				обязана сделать запрос в партнерский платежный сервис для выплаты
				Пользователю накопленных средств. - в случае возникновения форс-мажорных
				обстоятельств, влияющих на возможность осуществления выплат,
				Администрация оставляет за собой право приостановить или изменить
				условия выплат до устранения причин форс-мажора. - Пользователь имеет
				право запросить у Администрации вывод накопленных денежных средств через
				партнерский платежный сервис. Процедура разрешения споров, связанных с
				выплатами: - в случае, если выплата не выполняется по вине
				Администрации, последняя обязана произвести выплату. - в случае, если
				выплата не выполняется по вине партнерского платежного сервиса,
				Администрация ответственности не несет, но обязана по возможности
				предпринимать действия для осуществления выплаты. - в случае, если
				выплата не выполняется по вине Пользователя, Администрация
				ответственности не несет, но обязана по возможности содействовать
				Пользователю для осуществления выплаты. Ответственность сторон -
				пользователь лично несет полную ответственность за распространяемую им
				информацию - администрация не несет никакой ответственности за
				достоверность информации, скопированной из других источников -
				администрация не несёт ответственность за несовпадение ожидаемых
				Пользователем и реально полученных услуг - администрация не несет
				никакой ответственности за услуги, предоставляемые третьими лицами - в
				случае возникновения форс-мажорной ситуации (боевые действия,
				чрезвычайное положение, стихийное бедствие и т. д.) Администрация не
				гарантирует сохранность информации, размещённой Пользователем, а также
				бесперебойную работу информационного ресурса Условия действия Соглашения
				Данное Соглашение вступает в силу при любом использовании данного сайта.
				Соглашение перестает действовать при появлении его новой версии.
				Администрация оставляет за собой право в одностороннем порядке изменять
				данное соглашение по своему усмотрению. Администрация не оповещает
				пользователей об изменении в Соглашении.
			</p> */}
			
			<embed src={'../src/assets/UserSuccess.pdf'} type="application/pdf" width="100%" height="100%" className='h-[100vh]' />
		</>
	)
}
export default UserSuccess
