
SOLVENCY_CHOICES = (
    ('top1', 'Топ 1%'),
    ('top2_5', '2-5%'),
    ('top6_10', '6-10%'),
    ('top11_40', '11-40%'),
)

# структура и возможные значения списка в поле с полом-возрастом 
# если указана только макс возраст, то в мин сохранять 0, наоборот, в макс сохранять 140
# GENDER_AGE_LIST = [
#     ['men', 'мин_возраст', 'макс_возраст'],
#     ['woman', 'мин_возраст', 'макс_возраст'],
#     ['men_woman', 'мин_возраст', 'макс_возраст'],
#     ['none', 'мин_возраст', 'макс_возраст'],
# ]

# структура и возможные значения списка в поле с типами устройств
# DEVICE_LIST = [
#     ['desktop': ['MacOS', 'Windows', 'Другие']],
#     ['tablet': ['Android', 'iOS', 'Другие']],
#     ['smartphone': ['Android', 'iOS', 'Другие']],
# ]

# структура списка в поле с категориями и подкатегориями
# CATEGORY_LIST = [
#     ['категория1', ['категория2','категория2',]],
# ]

# структура списка в поле с интересами
# INTEREST_LIST = [
#     ['интерес1', ['интерес2', ['интерес3','интерес3',],],],
# ]

# структура списка в поле с географией
# GEOGRAPHY_LIST = [
#     ['страна', ['регион1', ['регион2', ['регион3', ['регион4','регион4',]],],],],
# ]